[
  {
    "id": "card_16",
    "topic": "Time Management",
    "content": "The client requested urgent revisions while we were finalizing documentation.\nI created a simple priority matrix to classify tasks into “urgent and high-impact” vs. “low-impact.”\nThat helped the team focus and meet the final deadline without sacrificing quality.\nResult: We delivered the final system on time, earning positive client feedback."
  },
  {
    "id": "card_15",
    "topic": "Conflict / Communication",
    "content": "At one point, a compliance manager disagreed with how our control points were labeled.\nInstead of arguing by email, I scheduled a short call to understand her perspective.\nI showed her our logic visually on the process diagram and proposed using both terminologies side-by-side.\nResult: She approved the change, and we avoided rework — strengthening collaboration and trust."
  },
  {
    "id": "card_14",
    "topic": "Adaptability Learning",
    "content": "Before this project, I had no prior experience in quality management systems.\nI quickly studied ISO 13485 basics and our SaaS platform’s configuration logic through online materials and shadowing a senior consultant.\nWithin two weeks, I was confident enough to handle the system flow mapping independently.\nResult: My manager later asked me to train two new interns on the same topic."
  },
  {
    "id": "card_13",
    "topic": "Problem Solving",
    "content": "One issue we faced was data inconsistency between the client’s Excel trackers and the new QMS platform.\nI investigated the source, found that naming conventions differed across departments, and proposed a validation rule in the system to flag mismatches automatically.\nResult: The solution reduced error reports by 40% in the next cycle."
  },
  {
    "id": "card_12",
    "topic": "Leadership Initiative",
    "content": "I noticed that our project lacked a unified template for documenting control points.\nInstead of waiting, I proposed a standardized control documentation format.\nI tested it on one module, showed how it improved audit readiness, and the team later adopted it across the project.\nResult: My initiative saved each consultant about two hours per audit preparation and strengthened our deliverable quality."
  },
  {
    "id": "card_11",
    "topic": "Teamwork",
    "content": "I collaborated with cross-functional teams — from IT, compliance, and manufacturing — to understand their workflows.\nAt first, there were conflicts about responsibilities, but I organized short working sessions where each team visualized their process steps.\nBy aligning everyone on a shared process map, we built stronger communication and delivered a more integrated system.\nResult: The client adopted the process map as their new standard, improving efficiency by 25%."
  },
  {
    "id": "card_10",
    "topic": "What interests you most about risk and control management at Amex National Bank?",
    "content": "I’m drawn to the intersection of data, processes, and risk management.At American Express National Bank, control management directly impacts the company’s financial stability and reputation — it’s where analytical thinking meets real-world responsibility.\nWith my background in data analytics and quality-management projects, I’m excited to learn how Amex integrates governance, technology, and compliance to build a stronger control environment"
  },
  {
    "id": "card_9",
    "topic": "Suppose multiple teams are not following a required control process — what would you do?",
    "content": "I’d start by understanding why the control isn’t followed — maybe the process is unclear, or it slows operations.Then I’d discuss with stakeholders to balance compliance and practicality.\nMy goal would be to re-design or simplify the control so it’s easier to adopt while still meeting regulatory requirements.Finally, I’d communicate progress and monitor compliance after rollout."
  },
  {
    "id": "card_8",
    "topic": "How would you handle inconsistent or missing data in a control report?",
    "content": "First, I’d verify the data source and confirm whether the issue is a reporting error or an upstream process problem.Then, I’d document the impact and communicate with the data owner to correct it.\nIf it’s a systemic issue, I’d recommend control steps like automated validation checks or exception alerts.Transparency and traceability are key — management must know what they can trust in the report."
  },
  {
    "id": "card_7",
    "topic": "How would you track or report risk metrics to management?",
    "content": "I’d maintain a simple dashboard that tracks key risk indicators, control test results, and open issues.I’d highlight trends or exceptions with visuals like traffic-light colors — green, yellow, red — to help managers quickly focus on what matters.\nClear communication is critical: it’s not just about data, but helping leaders understand which risks need action now."
  },
  {
    "id": "card_6",
    "topic": "What are Key Risk Indicators (KRIs), and how are they used?",
    "content": "KRIs are measurable metrics that help track potential risk exposures over time.For example, a sudden rise in failed transactions or delayed reconciliations might indicate process risk.\nBy monitoring KRIs on dashboards, control teams can spot trends early and take preventive actions before an incident escalates.In short, KRIs turn risk monitoring into data-driven decision-making."
  },
  {
    "id": "card_5",
    "topic": "If you found a recurring issue, how would you perform root cause analysis?",
    "content": "I’d first collect facts — when, where, and how often the issue happens.Then, I’d use a simple “5 Whys” approach to trace it back to the real cause, whether it’s a policy gap, training issue, or system error.\nAfter identifying the root cause, I’d suggest corrective actions and monitor whether they actually fix the problem.This method prevents future repeats instead of just treating symptoms."
  },
  {
    "id": "card_4",
    "topic": "How would you assess whether a control is effective?",
    "content": "I’d evaluate it based on design and operating effectiveness.Design means the control logically prevents or detects the risk; operating effectiveness means it actually works in practice.\nI’d test by sampling evidence — for example, checking if approvals or reconciliations were consistently completed — and see if exceptions exist.If the control fails, I’d recommend adjustments or automation to strengthen it."
  },
  {
    "id": "card_3",
    "topic": "How would you identify key risks in a new business process?",
    "content": "I’d start by mapping the end-to-end process — understanding each step, its purpose, and owners.Then, I’d identify potential failure points using “what-if” thinking: what if data is wrong, approvals are skipped, or systems fail?After that, I’d assess impact and likelihood, prioritize the highest risks, and check if existing controls cover them.\nThis structured approach helps ensure no blind spots remain."
  },
  {
    "id": "card_2",
    "topic": "What is operational risk, and why is it important in banking?",
    "content": "Operational risk refers to losses resulting from failed processes, systems, or human errors — rather than market or credit risk. In banking, it’s critical because even small process failures can lead to large financial or reputational losses.\nFor instance, a data entry error in a loan system or an untested change in a transaction process can cause compliance breaches. Effective control management reduces those risks and keeps customer trust."
  },
  {
    "id": "card_1",
    "topic": "What does “Control Management” mean to you?",
    "content": "Control Management means ensuring that business processes operate effectively and within risk and compliance standards. It’s about identifying where things could go wrong, designing controls to prevent or detect those issues, and continuously testing whether those controls work.\nFor example, in my previous project at IQVIA, we built a quality management workflow to reduce manual data errors. I helped define checkpoints and approval steps — that’s essentially applying control management principles: preventing risk before it happens."
  },
  {
    "id": 1763891314602,
    "topic": "Database Sharding Strategy",
    "content": "1. Sharding is horizontal partitioning of data across multiple database instances.\\n2. Key method: Hash/Key-based Sharding (distribute by primary key).\\n3. Directory-based Sharding: Uses a lookup service to map data to a shard.\\n4. Risk: Complexity, costly re-sharding, JOIN operations become harder."
  }
]