[
  {
    "id": "card_30",
    "topic": "What is WACC",
    "content": "Weighted Average Cost of Capital. It represents the blended cost to the company of borrowing money (debt) and raising funds from investors (equity)"
  },
  {
    "id": "card_29",
    "topic": "Why would two companies with identical financials be acquired at different multiples?",
    "content": "One might have better growth prospects, valuable intellectual property, a strategic geographic location, or be the subject of a bidding war."
  },
  {
    "id": "card_28",
    "topic": "Which is more expensive: Cost of Debt or Cost of Equity?",
    "content": "Cost of Equity is higher. Debt is less risky (senior to equity in bankruptcy) and interest payments are tax-deductible (tax shield). Equity investors demand higher returns for higher risk."
  },
  {
    "id": "card_27",
    "topic": "What is Beta?",
    "content": "Beta measures the volatility of a stock relative to the overall market. Beta = 1 means it moves with the market; >1 is more volatile; <1 is less volatile."
  },
  {
    "id": "card_26",
    "topic": "Why would one company acquire another?",
    "content": "To achieve synergies (cost savings or revenue growth), gain market share, acquire new technology/IP, or for vertical integration."
  },
  {
    "id": "card_25",
    "topic": "What is an Accretive vs. Dilutive merger?",
    "content": "A merger is accretive if the acquirer's Earnings Per Share (EPS) increases after the deal. It is dilutive if the EPS decreases."
  },
  {
    "id": "card_24",
    "topic": "What is the difference between Enterprise Value and Equity Value?",
    "content": "Enterprise Value is the value of the firm to all investors (Debt + Equity). Equity Value is the value available only to shareholders. EV = Equity Value + Debt + Preferred Stock + Minority Interest - Cash."
  },
  {
    "id": "card_23",
    "topic": "Walk me through a DCF",
    "content": "Weighted Average Cost of Capital. It represents the blended cost to the company of borrowing money (debt) and raising funds from investors (equity)."
  },
  {
    "id": "card_22",
    "topic": "Which valuation method usually gives the highest value?",
    "content": "Precedent Transactions. This is because the buyer typically pays a \"Control Premium\" to acquire the company."
  },
  {
    "id": "card_21",
    "topic": "What are the main ways to value a company?",
    "content": "Comparable Companies Analysis (Comps), Precedent Transactions, and Discounted Cash Flow (DCF) analysis."
  },
  {
    "id": "card_20",
    "topic": ":What is Working Capital",
    "content": "Current Assets minus Current Liabilities. It represents the operating liquidity available to a business. Positive working capital implies the company can pay off its short-term liabilities."
  },
  {
    "id": "card_19",
    "topic": "What is EBITDA?",
    "content": "Earnings Before Interest, Taxes, Depreciation, and Amortization. It is used as a proxy for a company's core operational profitability and cash flow potential, ignoring capital structure and tax jurisdictions."
  },
  {
    "id": "card_18",
    "topic": "If Depreciation increases by $10, how does that affect the statements?",
    "content": "A: Income Statement: Net Income down by $6. Cash Flow Statement: Net Income down $6 but add back $10 depreciation, so Cash is up by $4. Balance Sheet: Cash up $4, PP&E down $10, Retained Earnings down $6. It balances."
  },
  {
    "id": "card_17",
    "topic": "How are the three statements linked?",
    "content": "Net Income from the Income Statement flows into the Cash Flow Statement (top line) and the Balance Sheet (Retained Earnings). The ending Cash balance on the CFS flows into the Cash line on the Balance Sheet."
  },
  {
    "id": "card_16",
    "topic": "What are the three financial statements?",
    "content": "The Income Statement, Balance Sheet, and Cash Flow Statement."
  },
  {
    "id": "card_15",
    "topic": "How do you handle multiple tasks under high pressure?",
    "content": "I use a strict priority list, communicate status early and often, and am not afraid to ask for help to ensure the team meets the deadline with high-quality work."
  },
  {
    "id": "card_14",
    "topic": "Tell me about a time you showed leadership.",
    "content": "Use the STAR method (Situation, Task, Action, Result). Focus on a specific conflict or challenge, how you facilitated a solution, and the positive outcome."
  },
  {
    "id": "card_13",
    "topic": "What is your greatest weakness?",
    "content": "A: Pick a real weakness (e.g., sometimes getting too lost in details), but emphasize how you are actively fixing it (e.g., setting strict time limits and focusing on the big picture)."
  },
  {
    "id": "card_12",
    "topic": "Why Investment Banking",
    "content": "I want the steep learning curve, I thrive in fast-paced/high-pressure environments, and I want exposure to high-level strategic decision-making early in my career."
  },
  {
    "id": "card_11",
    "topic": "Walk me through your resume",
    "content": "A: Start chronologically: Background -> University/Internships -> Why Investment Banking -> Why this firm/now. Focus on quantifiable achievements relevant to the role."
  },
  {
    "id": "card_10",
    "topic": "What are Key Risk Indicators (KRIs), and how are they used?",
    "content": "KRIs are measurable metrics that help track potential risk exposures over time.For example, a sudden rise in failed transactions or delayed reconciliations might indicate process risk.\nBy monitoring KRIs on dashboards, control teams can spot trends early and take preventive actions before an incident escalates.In short, KRIs turn risk monitoring into data-driven decision-making."
  },
  {
    "id": "card_9",
    "topic": "If you found a recurring issue, how would you perform root cause analysis?",
    "content": "I’d first collect facts — when, where, and how often the issue happens.Then, I’d use a simple “5 Whys” approach to trace it back to the real cause, whether it’s a policy gap, training issue, or system error.\nAfter identifying the root cause, I’d suggest corrective actions and monitor whether they actually fix the problem.This method prevents future repeats instead of just treating symptoms."
  },
  {
    "id": "card_8",
    "topic": "How would you assess whether a control is effective?",
    "content": "I’d evaluate it based on design and operating effectiveness.Design means the control logically prevents or detects the risk; operating effectiveness means it actually works in practice.\nI’d test by sampling evidence — for example, checking if approvals or reconciliations were consistently completed — and see if exceptions exist.If the control fails, I’d recommend adjustments or automation to strengthen it."
  },
  {
    "id": "card_7",
    "topic": "How would you identify key risks in a new business process?",
    "content": "I’d start by mapping the end-to-end process — understanding each step, its purpose, and owners.Then, I’d identify potential failure points using “what-if” thinking: what if data is wrong, approvals are skipped, or systems fail?After that, I’d assess impact and likelihood, prioritize the highest risks, and check if existing controls cover them.\nThis structured approach helps ensure no blind spots remain."
  },
  {
    "id": "card_6",
    "topic": "What is operational risk, and why is it important in banking?",
    "content": "Operational risk refers to losses resulting from failed processes, systems, or human errors — rather than market or credit risk. In banking, it’s critical because even small process failures can lead to large financial or reputational losses.\nFor instance, a data entry error in a loan system or an untested change in a transaction process can cause compliance breaches. Effective control management reduces those risks and keeps customer trust."
  },
  {
    "id": "card_5",
    "topic": "What does “Control Management” mean to you?",
    "content": "Control Management means ensuring that business processes operate effectively and within risk and compliance standards. It’s about identifying where things could go wrong, designing controls to prevent or detect those issues, and continuously testing whether those controls work.\nFor example, in my previous project at IQVIA, we built a quality management workflow to reduce manual data errors. I helped define checkpoints and approval steps — that’s essentially applying control management principles: preventing risk before it happens."
  },
  {
    "id": "card_4",
    "topic": "What is operational risk, and why is it important in banking?",
    "content": "Operational risk refers to losses resulting from failed processes, systems, or human errors — rather than market or credit risk. In banking, it’s critical because even small process failures can lead to large financial or reputational losses.\nFor instance, a data entry error in a loan system or an untested change in a transaction process can cause compliance breaches. Effective control management reduces those risks and keeps customer trust."
  },
  {
    "id": "card_3",
    "topic": "What does “Control Management” mean to you? Answer Template：",
    "content": "Control Management means ensuring that business processes operate effectively and within risk and compliance standards. It’s about identifying where things could go wrong, designing controls to prevent or detect those issues, and continuously testing whether those controls work.\nFor example, in my previous project at IQVIA, we built a quality management workflow to reduce manual data errors. I helped define checkpoints and approval steps — that’s essentially applying control management principles: preventing risk before it happens."
  },
  {
    "id": "card_2",
    "topic": "asd",
    "content": "kuhaydfkjahsdgfkjahsdgfkjashdgfakjbxzcjhkvbakjhsdbvf\nasdkjfuhygasdkhjfgasdjhklfgaskjdhfgakjshdgfmb czxjkvosadhugfoiawluegfkuiasdhgbfkhjasdfasd\nasdfkjhgasdkhjfavsdhjkfgvalksiudgfoawuhvbkjhasvgxcoifuhasdf\nasdlkjfhggaoiwsleuhvbfjakhldgfiopuagerbfawef"
  },
  {
    "id": "card_1",
    "topic": "abc",
    "content": "abasdkj\nasdjhkg\nasd\nasd\nasd\nasd\nasd\nasd\nasd\nasd\nasd\nasd\nasd\nasd\nasd\nasd"
  }
]